NatsuDrag9/STM32f413xx-drivers-from-scratch/code/drivers/inc/usr_stm32f413xx.h
/*
 * stm32f413xx.h
 *
 *	MCU specific data
 *
 *	This header contains macros defining base addresses
 *	of memory, clock and device peripherals of STM32F$13xx.
 *
 *	Reference manual of STM32F413ZH with ARM Cortex M4 is
 *	referred to as STM32F4_RM.
 *	Datasheet and Usermanual of STM32F$13ZH are referred
 *	to as STM32F4_DT and STM32F4_UM
 *
 */

#ifndef INC_UDEMY_STM32F413XX_H_
#define INC_UDEMY_STM32F413XX_H_

#include <stdint.h>

/* ******************************************* PROCESSOR SPECIFIC DETAILS ******************************************
 *
 * ARM cortex Mx processor NVIC ISERx register base addresses
 *
 */

#define NVIC_ISER0			((volatile uint32_t*)0xE000E100)
#define NVIC_ISER1			((volatile uint32_t*)0xE000E104)
#define NVIC_ISER2			((volatile uint32_t*)0xE000E108)
#define NVIC_ISER3			((volatile uint32_t*)0xE000E10C)

/*
 * ARM cortex Mx processor NVIC ICERx register base addresses
 */

#define NVIC_ICER0			((volatile uint32_t*)0xE000E180)
#define NVIC_ICER1			((volatile uint32_t*)0xE000E184)
#define NVIC_ICER2			((volatile uint32_t*)0xE000E188)
#define NVIC_ICER3			((volatile uint32_t*)0xE000E18C)

/*
 * ARM cortex Mx processor NVIC IPRx (x = 0 to 59) register base address
 */
#define NVIC_IPRx_BASEADDR	((volatile uint32_t*)0xE000E400)

/*
 * ARM cortex Mx processor NVIC IPRx register 8-bit field implementation
 * Only the first four MSB bits are implemented and can be used to set
 * priority
 */
# define NO_PR_BITS_IMPLEMENTED	4		//

/* Base addresses of memory */
#define FLASH_BASEADDR		0x08000000U	// taken from section 2.6 on pg-65 in STM32F4_RM
#define SRAM1_BASEADDR		0x20000000U	// size = 256kB taken from section 2.3 on pg-62 in STM32F4_RM

/*
 * If SRAM2 base address is not detected, compute it by adding 256 kB to SRAM1's baseaddress
 * SRAM2_BASEADDRESS = toHex(256 *1-24) + 0x20000000UL
 */
//#define SRAM2_BASEADDR	0x20040000UL	// size = 64 kB taken from section 2.3 on pg-62 in STM32F4_RM

#define SYSMEM_BASEADDR		0x1FFF0000U	// system memory (which is ROM) is taken from section 2.6 on pg-65 in STM32F4_RM

/*
 * Base addresses of buses taken from
 * section 2.2.2 on pg-59 and pg-60 in STM32F4_RM
 */
#define PERIPH_BASE			0x40000000U
#define APB1PERIPH_BASE		PERIPH_BASE
#define APB2PERIPH_BASE		0x40010000U
#define AHB1PERIPH_BASE		0x40020000U
#define AHB2PERIPH_BASE		0x50000000U

/*
 * Base addresses of peripherals on AHB1 bus
 * taken from section 2.2.2 on pg-60 in STM32F4_RM
 */
#define GPIOA_BASEADDR		(AHB1PERIPH_BASE + 0x0000)
#define GPIOB_BASEADDR		(AHB1PERIPH_BASE + 0x0400)
#define GPIOC_BASEADDR		(AHB1PERIPH_BASE + 0x0800)
#define GPIOD_BASEADDR		(AHB1PERIPH_BASE + 0x0C00)
#define GPIOE_BASEADDR		(AHB1PERIPH_BASE + 0x1000)
#define GPIOF_BASEADDR		(AHB1PERIPH_BASE + 0x1400)
#define GPIOG_BASEADDR		(AHB1PERIPH_BASE + 0x1800)
#define GPIOH_BASEADDR		(AHB1PERIPH_BASE + 0x1C00)

#define RCC_BASEADDR		(AHB1PERIPH_BASE + 0x3800)

/*
 * Base addresses of peripherals on APB1 bus
 * taken from section 2.2.2 on pg-61 in STM32F4_RM
 */
#define I2C1_BASEADDR		(APB1PERIPH_BASE + 0x5400)
#define I2C2_BASEADDR		(APB1PERIPH_BASE + 0x5800)
#define I2C3_BASEADDR		(APB1PERIPH_BASE + 0x5C00)

#define SPI2_BASEADDR		(APB1PERIPH_BASE + 0x3800)
#define SPI3_BASEADDR		(APB1PERIPH_BASE + 0x3C00)

#define USART2_BASEADDR		(APB1PERIPH_BASE + 0x4400)
#define USART3_BASEADDR		(APB1PERIPH_BASE + 0x4800)
#define UART4_BASEADDR		(APB1PERIPH_BASE + 0x4C00)
#define UART5_BASEADDR		(APB1PERIPH_BASE + 0x5000)
#define UART7_BASEADDR		(APB1PERIPH_BASE + 0x7800)
#define UART8_BASEADDR		(APB1PERIPH_BASE + 0x7C00)

/*
 *  Base address of peripherals on APB2 bus
 *  taken from section 2.2.2 on pg-60 in STM32F4_RM
 */
#define EXTI_BASEADDR		(APB2PERIPH_BASE + 0x3C00)

#define SPI1_BASEADDR		(APB2PERIPH_BASE + 0x3000)
#define SPI4_BASEADDR		(APB2PERIPH_BASE + 0x3400)

#define SYSCFG_BASEADDR		(APB2PERIPH_BASE + 0x3800)

#define USART1_BASEADDR		(APB2PERIPH_BASE + 0x1000)
#define USART6_BASEADDR		(APB2PERIPH_BASE + 0x1400)
#define UART9_BASEADDR		(APB2PERIPH_BASE + 0x1800)
#define UART10_BASEADDR		(APB2PERIPH_BASE + 0x1C00)

/*
 * Peripheral register structure definition of GPIOx (x = A, B, ... H)
 * taken from section 7.4.11 on pg-202 in STM32F43_RM
 */
typedef struct {
	volatile uint32_t MODER;		// GPIO port mode register address offset is 0x00
	volatile uint32_t OTYPER;		// GPIO port output type register address offset is 0x04
	volatile uint32_t OSPEEDR;		// GPIO port output speed register address offset is 0x08
	volatile uint32_t PUPDR;		// GPIO port pull-up/pull-down register address offset is 0x0C
	volatile uint32_t IDR;			// GPIO port input data register address offset is 0x10
	volatile uint32_t ODR;			// GPIO port output data register address offset is 0x14
	volatile uint32_t BSRR;			// GPIO port bit set/reset register address offset is 0x18
	volatile uint32_t LCKR;			// GPIO port configuration lock register address offset is 0x1C
	volatile uint32_t AFR[2];		// GPIO alternate function low and high registers. Address offset of AFRL is 0x20 and AFRH is 0x24
} GPIO_RegDef_t;

/*
 * Peripheral register structure definition of RCC
 * taken from section 6.3.3.0 on pg-181 in STM32F4_RM
 */
typedef struct {
	volatile uint32_t CR;			// clock control register address offset is 0x00
	volatile uint32_t PLLCFGR;		// PLL configuration register address offset is 0x04
	volatile uint32_t CFGR;			// clock configuration register address offset is 0x08
	volatile uint32_t CIR;			// clock interrupt register address offset is 0x0C
	volatile uint32_t AHB1RSTR;		// AHB1 peripheral reset register address offset is 0x10
	volatile uint32_t AHB2RSTR;		// AHB2 peripheral reset register address offset is 0x14
	volatile uint32_t AHB3RSTR;		// AHB3 peripheral reset register address offset is 0x18

	volatile uint32_t RESERVED1;	// address offset is 0x1C

	volatile uint32_t APB1RSTR;		// APB1 peripheral reset register address offset is 0x20
	volatile uint32_t APB2RSTR;		// APB2 peripheral reset register address offset is 0x24

	volatile uint32_t RESERVED2;		// address offset is 0x28
	volatile uint32_t RESERVED3;		// address offset is 0x2C

