NatsuDrag9/STM32f413xx-drivers-from-scratch/code/drivers/inc/usr_stm32f413xx.h
	volatile uint32_t AHB1ENR;		// AHB1 peripheral clock enable register address offset is 0x30
	volatile uint32_t AHB2ENR;		// AHB2 peripheral clock enable register address offset is 0x34
	volatile uint32_t AHB3ENR;		// AHB3 peripheral clock enable register address offset is 0x38

	volatile uint32_t RESERVED4;	// address offset is 0x3C

	volatile uint32_t APB1ENR;		// APB1 peripheral clock enable register address offset is 0x40
	volatile uint32_t APB2ENR;		// APB2 peripheral clock enable register address offset is 0x44

	volatile uint32_t RESERVED5;	// address offset is 0x48
	volatile uint32_t RESERVED6;	// address offset is 0x4C

	volatile uint32_t AHB1LPENR;	// AHB1 peripheral clock enabled in low power mode register address offset is 0x50
	volatile uint32_t AHB2LPENR;	// AHB2 peripheral clock enabled in low power mode register address offset is 0x54
	volatile uint32_t AHB3LPENR;	// AHB3 peripheral clock enabled in low power mode register address offset is 0x58

	volatile uint32_t RESERVED7;	// address offset is 0x5C

	volatile uint32_t APB1LPENR;	// APB1 peripheral clock enabled in low power mode register address offset is 0x60
	volatile uint32_t APB2LPENR;	// APB2 peripheral clock enabled in low power mode register address offset is 0x64

	volatile uint32_t RESERVED8;	// address offset is 0x68
	volatile uint32_t RESERVED9;	// address offset is 0x6C

	volatile uint32_t BDCR;			// backup domain control register address offset is 0x70
	volatile uint32_t CSR;			// clock control & status register address offset is 0x74

	volatile uint32_t RESERVED10;	// address offset is 0x78
	volatile uint32_t RESERVED11;	// address offset is 0x7C

	volatile uint32_t SSCGR;		// spread spectrum clock generation register address offset is 0x80
	volatile uint32_t PLLI2SCFGR;	// PLLI2S configuration register address offset is 0x84

	volatile uint32_t RESERVED12;	// address offset is 0x88

	volatile uint32_t DCKCFGR;		// dedicated clocks configuration register 1 address offset is 0x8C
	volatile uint32_t CKGATENR;		// clocks gated enable register address offset is 0x90
	volatile uint32_t DCKCFGR2;		// dedicated clocks configuration register 2 address offset is 0x94
} RCC_RegDef_t;


/*
 * Peripheral register structure definition of EXTI
 * taken from section 10.3 on pg-258 in STM32F43_RM
 */
typedef struct {
	volatile uint32_t IMR;		// EXTI interrupt mask register address offset is 0x00
	volatile uint32_t EMR;		// EXTI event mask register address offset is 0x04
	volatile uint32_t RTSR;		// EXTI rising trigger selection register address offset is 0x08
	volatile uint32_t FTSR;		// EXTI falling trigger selection register address offset is 0x0C
	volatile uint32_t SWIER;	// EXTI software interrupt event register address offset is 0x10
	volatile uint32_t PR;		// EXTI pending register address offset is 0x14
} EXTI_RegDef_t;


/*
 * Peripheral register structure definition of SYSCFG
 * taken from section 8.2 on pg-204 in STM32F43_RM
 */
typedef struct {
	volatile uint32_t MEMRMP;		// SYSCFG memory remap register address offset is 0x00
	volatile uint32_t PMC;			// SYSCFG peripheral mode configuration register address offset is 0x04
	volatile uint32_t EXTICR[4];		// SYSCFG external interrupt configuration register 1 address offset is 0x08 - 0x14
//	volatile uint32_t EXTICR2;		// SYSCFG external interrupt configuration register 2 address offset is 0x0C
//	volatile uint32_t EXTICR3;		// SYSCFG external interrupt configuration register 3 address offset is 0x10
//	volatile uint32_t EXTICR4;		// SYSCFG external interrupt configuration register 4 address offset is 0x14
	volatile uint32_t CFGR2;		//  SYSCFG configuration register 2 address offset is 0x1C
	volatile uint32_t CMPCR;		//  SYSCFG compensation cell control register address offset is 0x20
	volatile uint32_t CFGR;			//  SYSCFG configuration register address offset is 0x2C
	volatile uint32_t MCHDLYCR;		//  SYSCFG DFSDM Multi-channel delay control register address offset is 0x30

} SYSCFG_RegDef_t;


/*
 * Peripheral register structure definition of SPI
 * taken from section 29.7 on pg-976 in STM32F43_RM
 */
typedef struct {
	volatile uint32_t CR1;		// SPI control register 1 address offset is 0x00
	volatile uint32_t CR2;		// SPI control register 2 address offset is 0x04
	volatile uint32_t SR;		// SPI status register address offset is 0x08
	volatile uint16_t DR;		// SPI data register address offset is 0x0C
	volatile uint32_t CRCPR;	// SPI CRC polynomial register address offset is 0x10
	volatile uint32_t RXCRCR;	// SPI RX CRC register address offset is 0x14
	volatile uint32_t TXCRCR;	// SPI TX CRC register address offset is 0x18
	volatile uint32_t I2SCFGR;	// SPI_I2S configuration register address offset is 0x1C
	volatile uint32_t I2SPR;	// SPI_I2S prescalar register address offset is 0x20
} SPI_RegDef_t;


/*
 * Peripheral register structure definition of I2C
 * taken from section 27.6 on pg-869 in STM32F43_RM
 */
typedef struct {
	volatile uint32_t CR1;		// I2C control register 1 address offset is 0x00
	volatile uint32_t CR2;		// I2C control register 2 address offset is 0x04
	volatile uint32_t OAR1;		// I2C own address register 1 address offset is 0x08
	volatile uint16_t OAR2;		// I2C own address register 2 address offset is 0x0C
	volatile uint32_t DR;		// I2C DR register address offset is 0x10
	volatile uint32_t SR1;		// I2C status register 1 address offset is 0x14
	volatile uint32_t SR2;		// I2C status register 2 address offset is 0x18
	volatile uint32_t CCR;		// I2C clock control register address offset is 0x1C
	volatile uint32_t TRISE;	// I2C TRISE register address offset is 0x20
	volatile uint32_t FLTR;		// I2C FLTR register address offset is 0x24
} I2C_RegDef_t;


/*
 * Peripheral structure register definition of USART
 * taken from section 28.6 on pg-924 in STM32F413XX_RM
 */
typedef struct {
	volatile uint32_t SR;		// USART status register address offset is 0x00
	volatile uint32_t DR;		// USART data register address offset is 0x04
	volatile uint32_t BRR;		// USART baud rate register address offset is 0x08
	volatile uint32_t CR1;		// USART control register 1 address offset is 0x0C
	volatile uint32_t CR2;		// USART control register 2 address offset is 0x10
	volatile uint32_t CR3;		// USART control register 3 address offset is 0x14
	volatile uint32_t GTPR;		// USART guart time and prescalar register address offset is 0x18
} USART_RegDef_t;

