NatsuDrag9/STM32f413xx-drivers-from-scratch/code/drivers/inc/usr_stm32f413xx.h
/*
 * I2C register reset macros
 * Resets by setting the corresponding bit-field to '1' then
 * clears the bit-field for the peripheral to be used again
 */
#define I2C1_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 21)); (RCC->APB1RSTR &= ~(1 << 21));} while(0)
#define I2C2_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 22)); (RCC->APB1RSTR &= ~(1 << 22));} while(0)
#define I2C3_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 23)); (RCC->APB1RSTR &= ~(1 << 23));} while(0)

/*
 * USART and UART register reset macros
 * Resets by setting the corresponding bit-field to '1' then
 * clears the bit-field for the peripheral to be used again
 */
#define USART1_REG_RESET()	do {(RCC->APB2RSTR |= (1 << 4)); (RCC->APB2RSTR &= ~(1 << 4));} while(0)
#define USART2_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 17)); (RCC->APB1RSTR &= ~(1 << 17));} while(0)
#define USART3_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 18)); (RCC->APB1RSTR &= ~(1 << 18));} while(0)
#define USART6_REG_RESET()	do {(RCC->APB2RSTR |= (1 << 5)); (RCC->APB2RSTR &= ~(1 << 5));} while(0)

#define UART4_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 19)); (RCC->APB1RSTR &= ~(1 << 19));} while(0)
#define UART5_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 20)); (RCC->APB1RSTR &= ~(1 << 20));} while(0)
#define UART7_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 30)); (RCC->APB1RSTR &= ~(1 << 30));} while(0)
#define UART8_REG_RESET()	do {(RCC->APB1RSTR |= (1 << 31)); (RCC->APB1RSTR &= ~(1 << 31));} while(0)
#define UART9_REG_RESET()	do {(RCC->APB2RSTR |= (1 << 6)); (RCC->APB2RSTR &= ~(1 << 6));} while(0)
#define UART10_REG_RESET()	do {(RCC->APB2RSTR |= (1 << 7)); (RCC->APB2RSTR &= ~(1 << 7));} while(0)

/* Macros for IRQ numbers of EXTIx lines */
#define IRQ_NO_EXTI0		6
#define IRQ_NO_EXTI1		7
#define IRQ_NO_EXTI2		8
#define IRQ_NO_EXTI3		9
#define IRQ_NO_EXTI4		10
#define IRQ_NO_EXTI9_5		23
#define IRQ_NO_EXTI15_10	40

/* Macros for IRQ numbers of SPIx lines */
#define IRQ_NO_SPI1			35
#define IRQ_NO_SPI2			36
#define IRQ_NO_SPI3			51
#define IRQ_NO_SPI4			84

/* Macros for IRQ numbers of I2Cx lines */
#define IRQ_NO_I2C1_EVT		31
#define IRQ_NO_I2C1_ERR		32
#define IRQ_NO_I2C2_EVT		33
#define IRQ_NO_I2C2_ERR		34
#define IRQ_NO_I2C3_EVT		72
#define IRQ_NO_I2C3_ERR		73

/* Macros for IRQ numbers of USARTx and UARTx lines */
#define IRQ_NO_USART1		37
#define IRQ_NO_USART2		38
#define IRQ_NO_USART3		39
#define IRQ_NO_USART6		71

#define IRQ_NO_UART4		52
#define IRQ_NO_UART5		53
#define IRQ_NO_UART7		82
#define IRQ_NO_UART8		83
#define IRQ_NO_UART9		88
#define IRQ_NO_UART10		89

/* Macros for NVIC interrupt priority levels */
#define NVIC_IRQ_PRIORITY0	0
#define NVIC_IRQ_PRIORITY1	1
#define NVIC_IRQ_PRIORITY2	2
#define NVIC_IRQ_PRIORITY3	3
#define NVIC_IRQ_PRIORITY4	4
#define NVIC_IRQ_PRIORITY5	5
#define NVIC_IRQ_PRIORITY6	6
#define NVIC_IRQ_PRIORITY7	7
#define NVIC_IRQ_PRIORITY8	8
#define NVIC_IRQ_PRIORITY9	9
#define NVIC_IRQ_PRIORITY10	10
#define NVIC_IRQ_PRIORITY11	11
#define NVIC_IRQ_PRIORITY12	12
#define NVIC_IRQ_PRIORITY13	13
#define NVIC_IRQ_PRIORITY14	14
#define NVIC_IRQ_PRIORITY15	15

/* General macros used by other files */
#define ENABLE			1
#define DISABLE			0
#define SET				ENABLE
#define RESET			DISABLE
#define GPIO_PIN_SET	SET
#define GPIO_PIN_RESET	RESET
#define FLAG_RESET		RESET
#define FLAG_SET		SET

#define GPIO_BASEADDR_TO_PORT_CODE(x)	((x == GPIOA) ? 0 :\
										 (x == GPIOB) ? 1 :\
										 (x == GPIOC) ? 2 :\
										 (x == GPIOD) ? 3 :\
										 (x == GPIOE) ? 4 :\
										 (x == GPIOF) ? 5 :\
										 (x == GPIOG) ? 6 :\
										 (x == GPIOH) ? 7 : 0)

/* CR1 register bit position definitions of SPI peripheral */
#define SPI_CR1_CPHA		0
#define SPI_CR1_CPOL		1
#define SPI_CR1_MSTR		2
#define SPI_CR1_BR			3
#define SPI_CR1_SPE			6
#define SPI_CR1_LSBFIRST	7
#define SPI_CR1_SSI			8
#define SPI_CR1_SSM			9
#define SPI_CR1_RXONLY		10
#define SPI_CR1_DFF			11
#define SPI_CR1_CRCNEXT		12
#define SPI_CR1_CRCEN		13
#define SPI_CR1_BIDIOE		14
#define SPI_CR1_BIDIMODE	15

/* CR2 register bit position definitions of SPI peripheral */
#define SPI_CR2_RXDMAEN		0
#define SPI_CR2_TXDMAEN		1
#define SPI_CR2_SSOE		2
#define SPI_CR2_FRF			4
#define SPI_CR2_ERRIE		5
#define SPI_CR2_RXNEIE		6
#define SPI_CR2_TXEIE		7

/* SR register bit position definitions of SPI peripheral */
#define SPI_SR_RXNE			0
#define SPI_SR_TXE			1
#define SPI_SR_CHSIDE		2
#define SPI_SR_UDR			3
#define SPI_SR_CRCERR		4
#define SPI_SR_MODF			5
#define SPI_SR_OVR			6
#define SPI_SR_BSY			7
#define SPI_SR_FRE			8

/* CR1 register bit position definitions of I2Cx (x = 1, 2, 3) peripheral */
#define I2C_CR1_PE			0
#define I2C_CR1_SMBUS		1
#define	I2C_CR1_SMBTYPE		3
#define I2C_CR1_ENARP		4
#define I2C_CR1_ENPEC		5
#define I2C_CR1_ENGC		6
#define I2C_CR1_NOSTRETCH	7
#define I2C_CR1_START		8
#define I2C_CR1_STOP		9
#define I2C_CR1_ACK			10
#define I2C_CR1_POS			11
#define I2C_CR1_PEC			12
#define I2C_CR1_ALERT		13
#define I2C_CR1_SWRST		15

/* CR2 register bit position definitions of I2Cx (x = 1, 2, 3) peripheral */
#define I2C_CR2_FREQ		0
#define I2C_CR2_ITERREN		8
#define I2C_CR2_ITEVTEN		9
#define I2C_CR2_ITBUFEN		10
#define I2C_CR2_DMAEN		11
#define I2C_CR2_LAST		12

/* SR1 register bit position definitions of I2Cx (x = 1, 2, 3) peripheral */
#define I2C_SR1_SB			0
#define I2C_SR1_ADDR		1
#define I2C_SR1_BTF			2
#define I2C_SR1_ADD10		3
#define I2C_SR1_STOPF		4
#define I2C_SR1_RXNE		6
#define I2C_SR1_TXE			7
#define I2C_SR1_BERR		8
#define I2C_SR1_ARLO		9
#define I2C_SR1_AF			10
#define I2C_SR1_OVR			11
#define I2C_SR1_PECERR		12
#define I2C_SR1_TIMEOUT		14
#define I2C_SR1_SMBALERT	15

/* SR2 register bit position definitions of I2Cx (x = 1, 2, 3) peripheral */
#define I2C_SR2_MSL			0
#define I2C_SR2_BUSY		1
#define I2C_SR2_TRA			2
#define I2C_SR2_GENCALL		4
#define I2C_SR2_SMBDEFAULT	5
#define I2C_SR2_SMBHOST		6
#define I2C_SR2_DUALF		7
#define I2C_SR2_PEC			8

/* CCR register bit position definitions of I2Cx (x = 1, 2, 3) peripheral */
#define I2C_CCR_CCR			0
#define I2C_CCR_DUTY		14
#define I2C_CCR_FS			15

