NatsuDrag9/STM32f413xx-drivers-from-scratch/code/drivers/inc/usr_stm32f413xx.h
/* TRISE register bit position definitions of I2Cx (x = 1, 2, 3) peripheral */
#define I2C_TRISE_TRISE		0

/*
 * SR register bit position definitions of USARTx (x = 1, 2, 3, 6)
 * and UARTx (x = 4, 5, 7, 8, 9, 10) peripheral
 */
#define USART_SR_PE			0
#define USART_SR_FE			1
#define USART_SR_NF			2
#define USART_SR_ORE		3
#define USART_SR_IDLE		4
#define USART_SR_RXNE		5
#define USART_SR_TC			6
#define USART_SR_TXE		7
#define USART_SR_LBD		8
#define USART_SR_CTS		9

/*
 * DR register bit position definitions of USARTx (x = 1, 2, 3, 6)
 * and UARTx (x = 4, 5, 7, 8, 9, 10) peripheral
 */
#define USART_DR		0

/*
 * BRR register bit position definitions of USARTx (x = 1, 2, 3, 6)
 * and UARTx (x = 4, 5, 7, 8, 9, 10) peripheral
 */
#define USART_BRR_DIV_FRACTION	0
#define USART_BRR_DIV_MANTISSA	4

/*
 * CR1 register bit position definitions of USARTx (x = 1, 2, 3, 6)
 * and UARTx (x = 4, 5, 7, 8, 9, 10) peripheral
 */
#define USART_CR1_SBK			0
#define USART_CR1_RWU			1
#define USART_CR1_RE			2
#define USART_CR1_TE			3
#define USART_CR1_IDLEIE		4
#define USART_CR1_RXNEIE		5
#define USART_CR1_TCIE			6
#define USART_CR1_TXIE			7
#define USART_CR1_PEIE			8
#define USART_CR1_PS			9
#define USART_CR1_PCE			10
#define USART_CR1_WAKE			11
#define USART_CR1_M				12
#define USART_CR1_UE			13
#define USART_CR1_OVER8			15

/*
 * CR3 register bit position definitions of USARTx (x = 1, 2, 3, 6)
 * and UARTx (x = 4, 5, 7, 8, 9, 10) peripheral
 */
#define USART_CR2_ADD			0
#define USART_CR2_LBDL			5
#define USART_CR2_LBDIE			6
#define USART_CR2_LBCL			8
#define USART_CR2_CPHA			9
#define USART_CR2_CPOL			10
#define USART_CR2_CLKEN			11
#define USART_CR2_STOP			12
#define USART_CR2_LINEN			14

/*
 * CR3 register bit position definitions of USARTx (x = 1, 2, 3, 6)
 * and UARTx (x = 4, 5, 7, 8, 9, 10) peripheral
 */
#define USART_CR3_EIE			0
#define USART_CR3_IREN			1
#define USART_CR3_IRLP			2
#define USART_CR3_HDSEL			3
#define USART_CR3_NACK			4
#define USART_CR3_SCEN			5
#define USART_CR3_DMAR			6
#define USART_CR3_DMAT			7
#define USART_CR3_RTSE			8
#define USART_CR3_CTSE			9
#define USART_CR3_CTSIE			10
#define USART_CR3_ONEBIT		11

/*
 *GTPR register bit position definitions of USARTx (x = 1, 2, 3, 6)
 * and UARTx (x = 4, 5, 7, 8, 9, 10) peripheral
 */
#define USART_GTPR_PSC			0
#define USART_GTPR_GT			7

/* Peripheral includes */
#include "usr_stm32f413xx_rcc.h"
#include "usr_stm32f413xx_gpio_driver.h"
#include "usr_stm32f413xx_spi_driver.h"
#include "usr_stm32f413xx_i2c_driver.h"
#include "usr_stm32f413xx_usart_driver.h"
#include <stddef.h>
#include <stdio.h>

#endif /* INC_UDEMY_STM32F413XX_H_ */
